app/views/dashboard/index.html.erb

SELECT "devices".* FROM "devices"
---
          <td><%= c.name %></td>
          <td><%= c.devices.count %></td>