app/views/employees/_employee.html.erb

SELECT "devices".* FROM "devices" INNER JOIN "devices_employees" ON "devices"."id" = "devices_employees"."device_id" WHERE "devices_employees"."employee_id" = ?  [["employee_id", 1]]
---
    <ul>
      <% employee.devices.each do |device| %>

SELECT "softwares".* FROM "softwares" INNER JOIN "employees_softwares" ON "softwares"."id" = "employees_softwares"."software_id" WHERE "employees_softwares"."employee_id" = ?  [["employee_id", 2]]
---
    <ul>
      <% employee.softwares.each do |software| %>