app/views/devices/_device.html.erb

SELECT "employees".* FROM "employees" INNER JOIN "devices_employees" ON "employees"."id" = "devices_employees"."employee_id" WHERE "devices_employees"."device_id" = ?  [["device_id", 1]]
---
  <strong>Assigned to:</strong>
  <% if device.employee.present? %>