app/views/softwares/_software.html.erb

    <ul>
      <% software.employees.each do |employee| %>
---
SELECT "employees".* FROM "employees" INNER JOIN "employees_softwares" ON "employees"."id" = "employees_softwares"."employee_id" WHERE "employees_softwares"."software_id" = ?  [["software_id", 1]]