app/controllers/dashboard_controller.rb

  def index
    @categories = Category.all
    @softwares = Software.all
---
SELECT "categories".* FROM "categories"
SELECT "softwares".* FROM "softwares"