app/controllers/devices_controller.rb

INSERT INTO "devices" ("name", "created_at", "updated_at", "employee_id", "category_id", "manufacturer_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "iPhone 15"], ["created_at", "2023-10-17 03:02:53.023934"], ["updated_at", "2023-10-17 03:02:53.023934"], ["employee_id", 1], ["category_id", "1"], ["manufacturer_id", "1"]]
---
  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save

UPDATE "devices" SET "updated_at" = ?, "manufacturer_id" = ? WHERE "devices"."id" = ?  [["updated_at", "2023-10-17 02:42:09.037840"], ["manufacturer_id", "1"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @device.update(device_params)

DELETE FROM "devices" WHERE "devices"."id" = ?  [["id", 1]]
---
  def destroy
    @device.destroy

SELECT "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_device
      @device = Device.find(params[:id])