app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Roy"], ["last_name", "Garrett"], ["created_at", "2023-10-10 00:17:24.359955"], ["updated_at", "2023-10-10 00:17:24.359955"]]

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE "employees" SET "last_name" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["last_name", "Garrett"], ["updated_at", "2023-10-11 02:39:47.338731"], ["id", 1]]