app/controllers/softwares_controller.rb

  def index
    @softwares = Software.all
---
SELECT "softwares".* FROM "softwares"

  def create
    @software = Software.new(software_params)

    respond_to do |format|
      if @software.save
---
INSERT INTO "softwares" ("name", "license_count", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Microsoft Windows"], ["license_count", 2], ["created_at", "2023-10-10 01:12:27.864783"], ["updated_at", "2023-10-10 01:12:27.864783"]]

  def update
    respond_to do |format|
      if @software.update(software_params)
---
UPDATE "softwares" SET "license_count" = ?, "updated_at" = ? WHERE "softwares"."id" = ?  [["license_count", 4], ["updated_at", "2023-10-19 05:38:02.993431"], ["id", 1]]

  def destroy
    @software.destroy
---
DELETE FROM "softwares" WHERE "softwares"."id" = ?  [["id", 1]]

    def set_software
      @software = Software.find(params[:id])
---
SELECT "softwares".* FROM "softwares" WHERE "softwares"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]